---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Insert(Autodesk.Revit.DB.Electrical.CorrectionFactor)
source: html/28e8dd84-003c-5181-dd2c-78bf04a80594.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	CorrectionFactor item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.CorrectionFactor`)